Model: "functional_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 48, 48, 3)]       0         
_________________________________________________________________
conv2d (Conv2D)              (None, 48, 48, 48)        1344      
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 24, 24, 48)        0         
_________________________________________________________________
batch_normalization (BatchNo (None, 24, 24, 48)        192       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 24, 24, 96)        41568     
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 24, 24, 96)        83040     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 12, 12, 96)        0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 12, 12, 96)        384       
_________________________________________________________________
dropout (Dropout)            (None, 12, 12, 96)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 12, 12, 192)       166080    
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 12, 12, 192)       331968    
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 12, 12, 192)       331968    
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 6, 6, 192)         0         
_________________________________________________________________
batch_normalization_2 (Batch (None, 6, 6, 192)         768       
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 6, 6, 384)         663936    
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 6, 6, 384)         1327488   
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 6, 6, 384)         1327488   
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 1, 1, 384)         0         
_________________________________________________________________
flatten (Flatten)            (None, 384)               0         
_________________________________________________________________
dense (Dense)                (None, 512)               197120    
_________________________________________________________________
dense_1 (Dense)              (None, 512)               262656    
_________________________________________________________________
dropout_1 (Dropout)          (None, 512)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 156)               80028     
_________________________________________________________________
dense_3 (Dense)              (None, 7)                 1099      
=================================================================
Total params: 4,817,127
Trainable params: 4,816,455
Non-trainable params: 672
_________________________________________________________________
None