Model: "Residual neural network"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_5 (InputLayer)            [(None, 72, 72, 3)]  0                                            
__________________________________________________________________________________________________
zero_padding2d_4 (ZeroPadding2D (None, 78, 78, 3)    0           input_5[0][0]                    
__________________________________________________________________________________________________
conv1 (Conv2D)                  (None, 36, 36, 64)   9472        zero_padding2d_4[0][0]           
__________________________________________________________________________________________________
bn_conv1 (BatchNormalization)   (None, 36, 36, 64)   256         conv1[0][0]                      
__________________________________________________________________________________________________
activation_147 (Activation)     (None, 36, 36, 64)   0           bn_conv1[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 17, 17, 64)   0           activation_147[0][0]             
__________________________________________________________________________________________________
res2a_branch2a (Conv2D)         (None, 17, 17, 64)   4160        max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
bn2a_branch2a (BatchNormalizati (None, 17, 17, 64)   256         res2a_branch2a[0][0]             
__________________________________________________________________________________________________
activation_148 (Activation)     (None, 17, 17, 64)   0           bn2a_branch2a[0][0]              
__________________________________________________________________________________________________
res2a_branch2b (Conv2D)         (None, 17, 17, 64)   36928       activation_148[0][0]             
__________________________________________________________________________________________________
bn2a_branch2b (BatchNormalizati (None, 17, 17, 64)   256         res2a_branch2b[0][0]             
__________________________________________________________________________________________________
activation_149 (Activation)     (None, 17, 17, 64)   0           bn2a_branch2b[0][0]              
__________________________________________________________________________________________________
res2a_branch2c (Conv2D)         (None, 17, 17, 256)  16640       activation_149[0][0]             
__________________________________________________________________________________________________
res2a_branch1 (Conv2D)          (None, 17, 17, 256)  16640       max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
bn2a_branch2c (BatchNormalizati (None, 17, 17, 256)  1024        res2a_branch2c[0][0]             
__________________________________________________________________________________________________
bn2a_branch1 (BatchNormalizatio (None, 17, 17, 256)  1024        res2a_branch1[0][0]              
__________________________________________________________________________________________________
add_48 (Add)                    (None, 17, 17, 256)  0           bn2a_branch2c[0][0]              
                                                                 bn2a_branch1[0][0]               
__________________________________________________________________________________________________
activation_150 (Activation)     (None, 17, 17, 256)  0           add_48[0][0]                     
__________________________________________________________________________________________________
res2b_branch2a (Conv2D)         (None, 17, 17, 64)   16448       activation_150[0][0]             
__________________________________________________________________________________________________
bn2b_branch2a (BatchNormalizati (None, 17, 17, 64)   256         res2b_branch2a[0][0]             
__________________________________________________________________________________________________
activation_151 (Activation)     (None, 17, 17, 64)   0           bn2b_branch2a[0][0]              
__________________________________________________________________________________________________
res2b_branch2b (Conv2D)         (None, 17, 17, 64)   36928       activation_151[0][0]             
__________________________________________________________________________________________________
bn2b_branch2b (BatchNormalizati (None, 17, 17, 64)   256         res2b_branch2b[0][0]             
__________________________________________________________________________________________________
activation_152 (Activation)     (None, 17, 17, 64)   0           bn2b_branch2b[0][0]              
__________________________________________________________________________________________________
res2b_branch2c (Conv2D)         (None, 17, 17, 256)  16640       activation_152[0][0]             
__________________________________________________________________________________________________
bn2b_branch2c (BatchNormalizati (None, 17, 17, 256)  1024        res2b_branch2c[0][0]             
__________________________________________________________________________________________________
add_49 (Add)                    (None, 17, 17, 256)  0           bn2b_branch2c[0][0]              
                                                                 activation_150[0][0]             
__________________________________________________________________________________________________
activation_153 (Activation)     (None, 17, 17, 256)  0           add_49[0][0]                     
__________________________________________________________________________________________________
res2c_branch2a (Conv2D)         (None, 17, 17, 64)   16448       activation_153[0][0]             
__________________________________________________________________________________________________
bn2c_branch2a (BatchNormalizati (None, 17, 17, 64)   256         res2c_branch2a[0][0]             
__________________________________________________________________________________________________
activation_154 (Activation)     (None, 17, 17, 64)   0           bn2c_branch2a[0][0]              
__________________________________________________________________________________________________
res2c_branch2b (Conv2D)         (None, 17, 17, 64)   36928       activation_154[0][0]             
__________________________________________________________________________________________________
bn2c_branch2b (BatchNormalizati (None, 17, 17, 64)   256         res2c_branch2b[0][0]             
__________________________________________________________________________________________________
activation_155 (Activation)     (None, 17, 17, 64)   0           bn2c_branch2b[0][0]              
__________________________________________________________________________________________________
res2c_branch2c (Conv2D)         (None, 17, 17, 256)  16640       activation_155[0][0]             
__________________________________________________________________________________________________
bn2c_branch2c (BatchNormalizati (None, 17, 17, 256)  1024        res2c_branch2c[0][0]             
__________________________________________________________________________________________________
add_50 (Add)                    (None, 17, 17, 256)  0           bn2c_branch2c[0][0]              
                                                                 activation_153[0][0]             
__________________________________________________________________________________________________
activation_156 (Activation)     (None, 17, 17, 256)  0           add_50[0][0]                     
__________________________________________________________________________________________________
res3a_branch2a (Conv2D)         (None, 9, 9, 128)    32896       activation_156[0][0]             
__________________________________________________________________________________________________
bn3a_branch2a (BatchNormalizati (None, 9, 9, 128)    512         res3a_branch2a[0][0]             
__________________________________________________________________________________________________
activation_157 (Activation)     (None, 9, 9, 128)    0           bn3a_branch2a[0][0]              
__________________________________________________________________________________________________
res3a_branch2b (Conv2D)         (None, 9, 9, 128)    147584      activation_157[0][0]             
__________________________________________________________________________________________________
bn3a_branch2b (BatchNormalizati (None, 9, 9, 128)    512         res3a_branch2b[0][0]             
__________________________________________________________________________________________________
activation_158 (Activation)     (None, 9, 9, 128)    0           bn3a_branch2b[0][0]              
__________________________________________________________________________________________________
res3a_branch2c (Conv2D)         (None, 9, 9, 512)    66048       activation_158[0][0]             
__________________________________________________________________________________________________
res3a_branch1 (Conv2D)          (None, 9, 9, 512)    131584      activation_156[0][0]             
__________________________________________________________________________________________________
bn3a_branch2c (BatchNormalizati (None, 9, 9, 512)    2048        res3a_branch2c[0][0]             
__________________________________________________________________________________________________
bn3a_branch1 (BatchNormalizatio (None, 9, 9, 512)    2048        res3a_branch1[0][0]              
__________________________________________________________________________________________________
add_51 (Add)                    (None, 9, 9, 512)    0           bn3a_branch2c[0][0]              
                                                                 bn3a_branch1[0][0]               
__________________________________________________________________________________________________
activation_159 (Activation)     (None, 9, 9, 512)    0           add_51[0][0]                     
__________________________________________________________________________________________________
res3b_branch2a (Conv2D)         (None, 9, 9, 128)    65664       activation_159[0][0]             
__________________________________________________________________________________________________
bn3b_branch2a (BatchNormalizati (None, 9, 9, 128)    512         res3b_branch2a[0][0]             
__________________________________________________________________________________________________
activation_160 (Activation)     (None, 9, 9, 128)    0           bn3b_branch2a[0][0]              
__________________________________________________________________________________________________
res3b_branch2b (Conv2D)         (None, 9, 9, 128)    147584      activation_160[0][0]             
__________________________________________________________________________________________________
bn3b_branch2b (BatchNormalizati (None, 9, 9, 128)    512         res3b_branch2b[0][0]             
__________________________________________________________________________________________________
activation_161 (Activation)     (None, 9, 9, 128)    0           bn3b_branch2b[0][0]              
__________________________________________________________________________________________________
res3b_branch2c (Conv2D)         (None, 9, 9, 512)    66048       activation_161[0][0]             
__________________________________________________________________________________________________
bn3b_branch2c (BatchNormalizati (None, 9, 9, 512)    2048        res3b_branch2c[0][0]             
__________________________________________________________________________________________________
add_52 (Add)                    (None, 9, 9, 512)    0           bn3b_branch2c[0][0]              
                                                                 activation_159[0][0]             
__________________________________________________________________________________________________
activation_162 (Activation)     (None, 9, 9, 512)    0           add_52[0][0]                     
__________________________________________________________________________________________________
res3c_branch2a (Conv2D)         (None, 9, 9, 128)    65664       activation_162[0][0]             
__________________________________________________________________________________________________
bn3c_branch2a (BatchNormalizati (None, 9, 9, 128)    512         res3c_branch2a[0][0]             
__________________________________________________________________________________________________
activation_163 (Activation)     (None, 9, 9, 128)    0           bn3c_branch2a[0][0]              
__________________________________________________________________________________________________
res3c_branch2b (Conv2D)         (None, 9, 9, 128)    147584      activation_163[0][0]             
__________________________________________________________________________________________________
bn3c_branch2b (BatchNormalizati (None, 9, 9, 128)    512         res3c_branch2b[0][0]             
__________________________________________________________________________________________________
activation_164 (Activation)     (None, 9, 9, 128)    0           bn3c_branch2b[0][0]              
__________________________________________________________________________________________________
res3c_branch2c (Conv2D)         (None, 9, 9, 512)    66048       activation_164[0][0]             
__________________________________________________________________________________________________
bn3c_branch2c (BatchNormalizati (None, 9, 9, 512)    2048        res3c_branch2c[0][0]             
__________________________________________________________________________________________________
add_53 (Add)                    (None, 9, 9, 512)    0           bn3c_branch2c[0][0]              
                                                                 activation_162[0][0]             
__________________________________________________________________________________________________
activation_165 (Activation)     (None, 9, 9, 512)    0           add_53[0][0]                     
__________________________________________________________________________________________________
res3d_branch2a (Conv2D)         (None, 9, 9, 128)    65664       activation_165[0][0]             
__________________________________________________________________________________________________
bn3d_branch2a (BatchNormalizati (None, 9, 9, 128)    512         res3d_branch2a[0][0]             
__________________________________________________________________________________________________
activation_166 (Activation)     (None, 9, 9, 128)    0           bn3d_branch2a[0][0]              
__________________________________________________________________________________________________
res3d_branch2b (Conv2D)         (None, 9, 9, 128)    147584      activation_166[0][0]             
__________________________________________________________________________________________________
bn3d_branch2b (BatchNormalizati (None, 9, 9, 128)    512         res3d_branch2b[0][0]             
__________________________________________________________________________________________________
activation_167 (Activation)     (None, 9, 9, 128)    0           bn3d_branch2b[0][0]              
__________________________________________________________________________________________________
res3d_branch2c (Conv2D)         (None, 9, 9, 512)    66048       activation_167[0][0]             
__________________________________________________________________________________________________
bn3d_branch2c (BatchNormalizati (None, 9, 9, 512)    2048        res3d_branch2c[0][0]             
__________________________________________________________________________________________________
add_54 (Add)                    (None, 9, 9, 512)    0           bn3d_branch2c[0][0]              
                                                                 activation_165[0][0]             
__________________________________________________________________________________________________
activation_168 (Activation)     (None, 9, 9, 512)    0           add_54[0][0]                     
__________________________________________________________________________________________________
res4a_branch2a (Conv2D)         (None, 5, 5, 256)    131328      activation_168[0][0]             
__________________________________________________________________________________________________
bn4a_branch2a (BatchNormalizati (None, 5, 5, 256)    1024        res4a_branch2a[0][0]             
__________________________________________________________________________________________________
activation_169 (Activation)     (None, 5, 5, 256)    0           bn4a_branch2a[0][0]              
__________________________________________________________________________________________________
res4a_branch2b (Conv2D)         (None, 5, 5, 256)    590080      activation_169[0][0]             
__________________________________________________________________________________________________
bn4a_branch2b (BatchNormalizati (None, 5, 5, 256)    1024        res4a_branch2b[0][0]             
__________________________________________________________________________________________________
activation_170 (Activation)     (None, 5, 5, 256)    0           bn4a_branch2b[0][0]              
__________________________________________________________________________________________________
res4a_branch2c (Conv2D)         (None, 5, 5, 1024)   263168      activation_170[0][0]             
__________________________________________________________________________________________________
res4a_branch1 (Conv2D)          (None, 5, 5, 1024)   525312      activation_168[0][0]             
__________________________________________________________________________________________________
bn4a_branch2c (BatchNormalizati (None, 5, 5, 1024)   4096        res4a_branch2c[0][0]             
__________________________________________________________________________________________________
bn4a_branch1 (BatchNormalizatio (None, 5, 5, 1024)   4096        res4a_branch1[0][0]              
__________________________________________________________________________________________________
add_55 (Add)                    (None, 5, 5, 1024)   0           bn4a_branch2c[0][0]              
                                                                 bn4a_branch1[0][0]               
__________________________________________________________________________________________________
activation_171 (Activation)     (None, 5, 5, 1024)   0           add_55[0][0]                     
__________________________________________________________________________________________________
res4b_branch2a (Conv2D)         (None, 5, 5, 256)    262400      activation_171[0][0]             
__________________________________________________________________________________________________
bn4b_branch2a (BatchNormalizati (None, 5, 5, 256)    1024        res4b_branch2a[0][0]             
__________________________________________________________________________________________________
activation_172 (Activation)     (None, 5, 5, 256)    0           bn4b_branch2a[0][0]              
__________________________________________________________________________________________________
res4b_branch2b (Conv2D)         (None, 5, 5, 256)    590080      activation_172[0][0]             
__________________________________________________________________________________________________
bn4b_branch2b (BatchNormalizati (None, 5, 5, 256)    1024        res4b_branch2b[0][0]             
__________________________________________________________________________________________________
activation_173 (Activation)     (None, 5, 5, 256)    0           bn4b_branch2b[0][0]              
__________________________________________________________________________________________________
res4b_branch2c (Conv2D)         (None, 5, 5, 1024)   263168      activation_173[0][0]             
__________________________________________________________________________________________________
bn4b_branch2c (BatchNormalizati (None, 5, 5, 1024)   4096        res4b_branch2c[0][0]             
__________________________________________________________________________________________________
add_56 (Add)                    (None, 5, 5, 1024)   0           bn4b_branch2c[0][0]              
                                                                 activation_171[0][0]             
__________________________________________________________________________________________________
activation_174 (Activation)     (None, 5, 5, 1024)   0           add_56[0][0]                     
__________________________________________________________________________________________________
res4c_branch2a (Conv2D)         (None, 5, 5, 256)    262400      activation_174[0][0]             
__________________________________________________________________________________________________
bn4c_branch2a (BatchNormalizati (None, 5, 5, 256)    1024        res4c_branch2a[0][0]             
__________________________________________________________________________________________________
activation_175 (Activation)     (None, 5, 5, 256)    0           bn4c_branch2a[0][0]              
__________________________________________________________________________________________________
res4c_branch2b (Conv2D)         (None, 5, 5, 256)    590080      activation_175[0][0]             
__________________________________________________________________________________________________
bn4c_branch2b (BatchNormalizati (None, 5, 5, 256)    1024        res4c_branch2b[0][0]             
__________________________________________________________________________________________________
activation_176 (Activation)     (None, 5, 5, 256)    0           bn4c_branch2b[0][0]              
__________________________________________________________________________________________________
res4c_branch2c (Conv2D)         (None, 5, 5, 1024)   263168      activation_176[0][0]             
__________________________________________________________________________________________________
bn4c_branch2c (BatchNormalizati (None, 5, 5, 1024)   4096        res4c_branch2c[0][0]             
__________________________________________________________________________________________________
add_57 (Add)                    (None, 5, 5, 1024)   0           bn4c_branch2c[0][0]              
                                                                 activation_174[0][0]             
__________________________________________________________________________________________________
activation_177 (Activation)     (None, 5, 5, 1024)   0           add_57[0][0]                     
__________________________________________________________________________________________________
res4d_branch2a (Conv2D)         (None, 5, 5, 256)    262400      activation_177[0][0]             
__________________________________________________________________________________________________
bn4d_branch2a (BatchNormalizati (None, 5, 5, 256)    1024        res4d_branch2a[0][0]             
__________________________________________________________________________________________________
activation_178 (Activation)     (None, 5, 5, 256)    0           bn4d_branch2a[0][0]              
__________________________________________________________________________________________________
res4d_branch2b (Conv2D)         (None, 5, 5, 256)    590080      activation_178[0][0]             
__________________________________________________________________________________________________
bn4d_branch2b (BatchNormalizati (None, 5, 5, 256)    1024        res4d_branch2b[0][0]             
__________________________________________________________________________________________________
activation_179 (Activation)     (None, 5, 5, 256)    0           bn4d_branch2b[0][0]              
__________________________________________________________________________________________________
res4d_branch2c (Conv2D)         (None, 5, 5, 1024)   263168      activation_179[0][0]             
__________________________________________________________________________________________________
bn4d_branch2c (BatchNormalizati (None, 5, 5, 1024)   4096        res4d_branch2c[0][0]             
__________________________________________________________________________________________________
add_58 (Add)                    (None, 5, 5, 1024)   0           bn4d_branch2c[0][0]              
                                                                 activation_177[0][0]             
__________________________________________________________________________________________________
activation_180 (Activation)     (None, 5, 5, 1024)   0           add_58[0][0]                     
__________________________________________________________________________________________________
res4e_branch2a (Conv2D)         (None, 5, 5, 256)    262400      activation_180[0][0]             
__________________________________________________________________________________________________
bn4e_branch2a (BatchNormalizati (None, 5, 5, 256)    1024        res4e_branch2a[0][0]             
__________________________________________________________________________________________________
activation_181 (Activation)     (None, 5, 5, 256)    0           bn4e_branch2a[0][0]              
__________________________________________________________________________________________________
res4e_branch2b (Conv2D)         (None, 5, 5, 256)    590080      activation_181[0][0]             
__________________________________________________________________________________________________
bn4e_branch2b (BatchNormalizati (None, 5, 5, 256)    1024        res4e_branch2b[0][0]             
__________________________________________________________________________________________________
activation_182 (Activation)     (None, 5, 5, 256)    0           bn4e_branch2b[0][0]              
__________________________________________________________________________________________________
res4e_branch2c (Conv2D)         (None, 5, 5, 1024)   263168      activation_182[0][0]             
__________________________________________________________________________________________________
bn4e_branch2c (BatchNormalizati (None, 5, 5, 1024)   4096        res4e_branch2c[0][0]             
__________________________________________________________________________________________________
add_59 (Add)                    (None, 5, 5, 1024)   0           bn4e_branch2c[0][0]              
                                                                 activation_180[0][0]             
__________________________________________________________________________________________________
activation_183 (Activation)     (None, 5, 5, 1024)   0           add_59[0][0]                     
__________________________________________________________________________________________________
res4f_branch2a (Conv2D)         (None, 5, 5, 256)    262400      activation_183[0][0]             
__________________________________________________________________________________________________
bn4f_branch2a (BatchNormalizati (None, 5, 5, 256)    1024        res4f_branch2a[0][0]             
__________________________________________________________________________________________________
activation_184 (Activation)     (None, 5, 5, 256)    0           bn4f_branch2a[0][0]              
__________________________________________________________________________________________________
res4f_branch2b (Conv2D)         (None, 5, 5, 256)    590080      activation_184[0][0]             
__________________________________________________________________________________________________
bn4f_branch2b (BatchNormalizati (None, 5, 5, 256)    1024        res4f_branch2b[0][0]             
__________________________________________________________________________________________________
activation_185 (Activation)     (None, 5, 5, 256)    0           bn4f_branch2b[0][0]              
__________________________________________________________________________________________________
res4f_branch2c (Conv2D)         (None, 5, 5, 1024)   263168      activation_185[0][0]             
__________________________________________________________________________________________________
bn4f_branch2c (BatchNormalizati (None, 5, 5, 1024)   4096        res4f_branch2c[0][0]             
__________________________________________________________________________________________________
add_60 (Add)                    (None, 5, 5, 1024)   0           bn4f_branch2c[0][0]              
                                                                 activation_183[0][0]             
__________________________________________________________________________________________________
activation_186 (Activation)     (None, 5, 5, 1024)   0           add_60[0][0]                     
__________________________________________________________________________________________________
res5a_branch2a (Conv2D)         (None, 3, 3, 512)    524800      activation_186[0][0]             
__________________________________________________________________________________________________
bn5a_branch2a (BatchNormalizati (None, 3, 3, 512)    2048        res5a_branch2a[0][0]             
__________________________________________________________________________________________________
activation_187 (Activation)     (None, 3, 3, 512)    0           bn5a_branch2a[0][0]              
__________________________________________________________________________________________________
res5a_branch2b (Conv2D)         (None, 3, 3, 512)    2359808     activation_187[0][0]             
__________________________________________________________________________________________________
bn5a_branch2b (BatchNormalizati (None, 3, 3, 512)    2048        res5a_branch2b[0][0]             
__________________________________________________________________________________________________
activation_188 (Activation)     (None, 3, 3, 512)    0           bn5a_branch2b[0][0]              
__________________________________________________________________________________________________
res5a_branch2c (Conv2D)         (None, 3, 3, 2048)   1050624     activation_188[0][0]             
__________________________________________________________________________________________________
res5a_branch1 (Conv2D)          (None, 3, 3, 2048)   2099200     activation_186[0][0]             
__________________________________________________________________________________________________
bn5a_branch2c (BatchNormalizati (None, 3, 3, 2048)   8192        res5a_branch2c[0][0]             
__________________________________________________________________________________________________
bn5a_branch1 (BatchNormalizatio (None, 3, 3, 2048)   8192        res5a_branch1[0][0]              
__________________________________________________________________________________________________
add_61 (Add)                    (None, 3, 3, 2048)   0           bn5a_branch2c[0][0]              
                                                                 bn5a_branch1[0][0]               
__________________________________________________________________________________________________
activation_189 (Activation)     (None, 3, 3, 2048)   0           add_61[0][0]                     
__________________________________________________________________________________________________
res5b_branch2a (Conv2D)         (None, 3, 3, 512)    1049088     activation_189[0][0]             
__________________________________________________________________________________________________
bn5b_branch2a (BatchNormalizati (None, 3, 3, 512)    2048        res5b_branch2a[0][0]             
__________________________________________________________________________________________________
activation_190 (Activation)     (None, 3, 3, 512)    0           bn5b_branch2a[0][0]              
__________________________________________________________________________________________________
res5b_branch2b (Conv2D)         (None, 3, 3, 512)    2359808     activation_190[0][0]             
__________________________________________________________________________________________________
bn5b_branch2b (BatchNormalizati (None, 3, 3, 512)    2048        res5b_branch2b[0][0]             
__________________________________________________________________________________________________
activation_191 (Activation)     (None, 3, 3, 512)    0           bn5b_branch2b[0][0]              
__________________________________________________________________________________________________
res5b_branch2c (Conv2D)         (None, 3, 3, 2048)   1050624     activation_191[0][0]             
__________________________________________________________________________________________________
bn5b_branch2c (BatchNormalizati (None, 3, 3, 2048)   8192        res5b_branch2c[0][0]             
__________________________________________________________________________________________________
add_62 (Add)                    (None, 3, 3, 2048)   0           bn5b_branch2c[0][0]              
                                                                 activation_189[0][0]             
__________________________________________________________________________________________________
activation_192 (Activation)     (None, 3, 3, 2048)   0           add_62[0][0]                     
__________________________________________________________________________________________________
res5c_branch2a (Conv2D)         (None, 3, 3, 512)    1049088     activation_192[0][0]             
__________________________________________________________________________________________________
bn5c_branch2a (BatchNormalizati (None, 3, 3, 512)    2048        res5c_branch2a[0][0]             
__________________________________________________________________________________________________
activation_193 (Activation)     (None, 3, 3, 512)    0           bn5c_branch2a[0][0]              
__________________________________________________________________________________________________
res5c_branch2b (Conv2D)         (None, 3, 3, 512)    2359808     activation_193[0][0]             
__________________________________________________________________________________________________
bn5c_branch2b (BatchNormalizati (None, 3, 3, 512)    2048        res5c_branch2b[0][0]             
__________________________________________________________________________________________________
activation_194 (Activation)     (None, 3, 3, 512)    0           bn5c_branch2b[0][0]              
__________________________________________________________________________________________________
res5c_branch2c (Conv2D)         (None, 3, 3, 2048)   1050624     activation_194[0][0]             
__________________________________________________________________________________________________
bn5c_branch2c (BatchNormalizati (None, 3, 3, 2048)   8192        res5c_branch2c[0][0]             
__________________________________________________________________________________________________
add_63 (Add)                    (None, 3, 3, 2048)   0           bn5c_branch2c[0][0]              
                                                                 activation_192[0][0]             
__________________________________________________________________________________________________
activation_195 (Activation)     (None, 3, 3, 2048)   0           add_63[0][0]                     
__________________________________________________________________________________________________
average_pooling2d_3 (AveragePoo (None, 2, 2, 2048)   0           activation_195[0][0]             
__________________________________________________________________________________________________
flatten_3 (Flatten)             (None, 8192)         0           average_pooling2d_3[0][0]        
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 512)          4194816     flatten_3[0][0]                  
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 512)          262656      dense_4[0][0]                    
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 512)          0           dense_5[0][0]                    
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 156)          80028       dropout_2[0][0]                  
__________________________________________________________________________________________________
fc7 (Dense)                     (None, 7)            1099        dense_6[0][0]                    
==================================================================================================
Total params: 28,126,311
Trainable params: 28,073,191
Non-trainable params: 53,120
__________________________________________________________________________________________________
None