Model: "ResNet"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            [(None, 48, 48, 3)]  0                                            
__________________________________________________________________________________________________
zero_padding2d_1 (ZeroPadding2D (None, 54, 54, 3)    0           input_2[0][0]                    
__________________________________________________________________________________________________
conv1 (Conv2D)                  (None, 24, 24, 48)   7104        zero_padding2d_1[0][0]           
__________________________________________________________________________________________________
bn_conv1 (BatchNormalization)   (None, 24, 24, 48)   192         conv1[0][0]                      
__________________________________________________________________________________________________
leaky_re_lu_28 (LeakyReLU)      (None, 24, 24, 48)   0           bn_conv1[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 12, 12, 48)   0           leaky_re_lu_28[0][0]             
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 12, 12, 48)   0           max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
res2a_branch2a (Conv2D)         (None, 6, 6, 48)     2352        dropout_4[0][0]                  
__________________________________________________________________________________________________
bn2a_branch2a (BatchNormalizati (None, 6, 6, 48)     192         res2a_branch2a[0][0]             
__________________________________________________________________________________________________
leaky_re_lu_29 (LeakyReLU)      (None, 6, 6, 48)     0           bn2a_branch2a[0][0]              
__________________________________________________________________________________________________
res2a_branch2b (Conv2D)         (None, 6, 6, 48)     57648       leaky_re_lu_29[0][0]             
__________________________________________________________________________________________________
bn2a_branch2b (BatchNormalizati (None, 6, 6, 48)     192         res2a_branch2b[0][0]             
__________________________________________________________________________________________________
leaky_re_lu_30 (LeakyReLU)      (None, 6, 6, 48)     0           bn2a_branch2b[0][0]              
__________________________________________________________________________________________________
res2a_branch2c (Conv2D)         (None, 6, 6, 48)     2352        leaky_re_lu_30[0][0]             
__________________________________________________________________________________________________
res2a_branch1 (Conv2D)          (None, 6, 6, 48)     2352        dropout_4[0][0]                  
__________________________________________________________________________________________________
bn2a_branch2c (BatchNormalizati (None, 6, 6, 48)     192         res2a_branch2c[0][0]             
__________________________________________________________________________________________________
bn2a_branch1 (BatchNormalizatio (None, 6, 6, 48)     192         res2a_branch1[0][0]              
__________________________________________________________________________________________________
add_8 (Add)                     (None, 6, 6, 48)     0           bn2a_branch2c[0][0]              
                                                                 bn2a_branch1[0][0]               
__________________________________________________________________________________________________
leaky_re_lu_31 (LeakyReLU)      (None, 6, 6, 48)     0           add_8[0][0]                      
__________________________________________________________________________________________________
res2b_branch2a (Conv2D)         (None, 3, 3, 48)     2352        leaky_re_lu_31[0][0]             
__________________________________________________________________________________________________
bn2b_branch2a (BatchNormalizati (None, 3, 3, 48)     192         res2b_branch2a[0][0]             
__________________________________________________________________________________________________
leaky_re_lu_32 (LeakyReLU)      (None, 3, 3, 48)     0           bn2b_branch2a[0][0]              
__________________________________________________________________________________________________
res2b_branch2b (Conv2D)         (None, 2, 2, 48)     57648       leaky_re_lu_32[0][0]             
__________________________________________________________________________________________________
bn2b_branch2b (BatchNormalizati (None, 2, 2, 48)     192         res2b_branch2b[0][0]             
__________________________________________________________________________________________________
leaky_re_lu_33 (LeakyReLU)      (None, 2, 2, 48)     0           bn2b_branch2b[0][0]              
__________________________________________________________________________________________________
res2b_branch2c (Conv2D)         (None, 1, 1, 48)     2352        leaky_re_lu_33[0][0]             
__________________________________________________________________________________________________
bn2b_branch2c (BatchNormalizati (None, 1, 1, 48)     192         res2b_branch2c[0][0]             
__________________________________________________________________________________________________
add_9 (Add)                     (None, 6, 6, 48)     0           bn2b_branch2c[0][0]              
                                                                 leaky_re_lu_31[0][0]             
__________________________________________________________________________________________________
leaky_re_lu_34 (LeakyReLU)      (None, 6, 6, 48)     0           add_9[0][0]                      
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, 6, 6, 48)     0           leaky_re_lu_34[0][0]             
__________________________________________________________________________________________________
res3a_branch2a (Conv2D)         (None, 3, 3, 96)     4704        dropout_5[0][0]                  
__________________________________________________________________________________________________
bn3a_branch2a (BatchNormalizati (None, 3, 3, 96)     384         res3a_branch2a[0][0]             
__________________________________________________________________________________________________
leaky_re_lu_35 (LeakyReLU)      (None, 3, 3, 96)     0           bn3a_branch2a[0][0]              
__________________________________________________________________________________________________
res3a_branch2b (Conv2D)         (None, 3, 3, 96)     230496      leaky_re_lu_35[0][0]             
__________________________________________________________________________________________________
bn3a_branch2b (BatchNormalizati (None, 3, 3, 96)     384         res3a_branch2b[0][0]             
__________________________________________________________________________________________________
leaky_re_lu_36 (LeakyReLU)      (None, 3, 3, 96)     0           bn3a_branch2b[0][0]              
__________________________________________________________________________________________________
res3a_branch2c (Conv2D)         (None, 3, 3, 96)     9312        leaky_re_lu_36[0][0]             
__________________________________________________________________________________________________
res3a_branch1 (Conv2D)          (None, 3, 3, 96)     4704        dropout_5[0][0]                  
__________________________________________________________________________________________________
bn3a_branch2c (BatchNormalizati (None, 3, 3, 96)     384         res3a_branch2c[0][0]             
__________________________________________________________________________________________________
bn3a_branch1 (BatchNormalizatio (None, 3, 3, 96)     384         res3a_branch1[0][0]              
__________________________________________________________________________________________________
add_10 (Add)                    (None, 3, 3, 96)     0           bn3a_branch2c[0][0]              
                                                                 bn3a_branch1[0][0]               
__________________________________________________________________________________________________
leaky_re_lu_37 (LeakyReLU)      (None, 3, 3, 96)     0           add_10[0][0]                     
__________________________________________________________________________________________________
res3b_branch2a (Conv2D)         (None, 2, 2, 96)     9312        leaky_re_lu_37[0][0]             
__________________________________________________________________________________________________
bn3b_branch2a (BatchNormalizati (None, 2, 2, 96)     384         res3b_branch2a[0][0]             
__________________________________________________________________________________________________
leaky_re_lu_38 (LeakyReLU)      (None, 2, 2, 96)     0           bn3b_branch2a[0][0]              
__________________________________________________________________________________________________
res3b_branch2b (Conv2D)         (None, 1, 1, 96)     230496      leaky_re_lu_38[0][0]             
__________________________________________________________________________________________________
bn3b_branch2b (BatchNormalizati (None, 1, 1, 96)     384         res3b_branch2b[0][0]             
__________________________________________________________________________________________________
leaky_re_lu_39 (LeakyReLU)      (None, 1, 1, 96)     0           bn3b_branch2b[0][0]              
__________________________________________________________________________________________________
res3b_branch2c (Conv2D)         (None, 1, 1, 96)     9312        leaky_re_lu_39[0][0]             
__________________________________________________________________________________________________
bn3b_branch2c (BatchNormalizati (None, 1, 1, 96)     384         res3b_branch2c[0][0]             
__________________________________________________________________________________________________
add_11 (Add)                    (None, 3, 3, 96)     0           bn3b_branch2c[0][0]              
                                                                 leaky_re_lu_37[0][0]             
__________________________________________________________________________________________________
leaky_re_lu_40 (LeakyReLU)      (None, 3, 3, 96)     0           add_11[0][0]                     
__________________________________________________________________________________________________
res3c_branch2a (Conv2D)         (None, 2, 2, 96)     9312        leaky_re_lu_40[0][0]             
__________________________________________________________________________________________________
bn3c_branch2a (BatchNormalizati (None, 2, 2, 96)     384         res3c_branch2a[0][0]             
__________________________________________________________________________________________________
leaky_re_lu_41 (LeakyReLU)      (None, 2, 2, 96)     0           bn3c_branch2a[0][0]              
__________________________________________________________________________________________________
res3c_branch2b (Conv2D)         (None, 1, 1, 96)     230496      leaky_re_lu_41[0][0]             
__________________________________________________________________________________________________
bn3c_branch2b (BatchNormalizati (None, 1, 1, 96)     384         res3c_branch2b[0][0]             
__________________________________________________________________________________________________
leaky_re_lu_42 (LeakyReLU)      (None, 1, 1, 96)     0           bn3c_branch2b[0][0]              
__________________________________________________________________________________________________
res3c_branch2c (Conv2D)         (None, 1, 1, 96)     9312        leaky_re_lu_42[0][0]             
__________________________________________________________________________________________________
bn3c_branch2c (BatchNormalizati (None, 1, 1, 96)     384         res3c_branch2c[0][0]             
__________________________________________________________________________________________________
add_12 (Add)                    (None, 3, 3, 96)     0           bn3c_branch2c[0][0]              
                                                                 leaky_re_lu_40[0][0]             
__________________________________________________________________________________________________
leaky_re_lu_43 (LeakyReLU)      (None, 3, 3, 96)     0           add_12[0][0]                     
__________________________________________________________________________________________________
dropout_6 (Dropout)             (None, 3, 3, 96)     0           leaky_re_lu_43[0][0]             
__________________________________________________________________________________________________
res5a_branch2a (Conv2D)         (None, 2, 2, 384)    37248       dropout_6[0][0]                  
__________________________________________________________________________________________________
bn5a_branch2a (BatchNormalizati (None, 2, 2, 384)    1536        res5a_branch2a[0][0]             
__________________________________________________________________________________________________
leaky_re_lu_44 (LeakyReLU)      (None, 2, 2, 384)    0           bn5a_branch2a[0][0]              
__________________________________________________________________________________________________
res5a_branch2b (Conv2D)         (None, 2, 2, 384)    3686784     leaky_re_lu_44[0][0]             
__________________________________________________________________________________________________
bn5a_branch2b (BatchNormalizati (None, 2, 2, 384)    1536        res5a_branch2b[0][0]             
__________________________________________________________________________________________________
leaky_re_lu_45 (LeakyReLU)      (None, 2, 2, 384)    0           bn5a_branch2b[0][0]              
__________________________________________________________________________________________________
res5a_branch2c (Conv2D)         (None, 2, 2, 384)    147840      leaky_re_lu_45[0][0]             
__________________________________________________________________________________________________
res5a_branch1 (Conv2D)          (None, 2, 2, 384)    37248       dropout_6[0][0]                  
__________________________________________________________________________________________________
bn5a_branch2c (BatchNormalizati (None, 2, 2, 384)    1536        res5a_branch2c[0][0]             
__________________________________________________________________________________________________
bn5a_branch1 (BatchNormalizatio (None, 2, 2, 384)    1536        res5a_branch1[0][0]              
__________________________________________________________________________________________________
add_13 (Add)                    (None, 2, 2, 384)    0           bn5a_branch2c[0][0]              
                                                                 bn5a_branch1[0][0]               
__________________________________________________________________________________________________
leaky_re_lu_46 (LeakyReLU)      (None, 2, 2, 384)    0           add_13[0][0]                     
__________________________________________________________________________________________________
res5b_branch2a (Conv2D)         (None, 1, 1, 384)    147840      leaky_re_lu_46[0][0]             
__________________________________________________________________________________________________
bn5b_branch2a (BatchNormalizati (None, 1, 1, 384)    1536        res5b_branch2a[0][0]             
__________________________________________________________________________________________________
leaky_re_lu_47 (LeakyReLU)      (None, 1, 1, 384)    0           bn5b_branch2a[0][0]              
__________________________________________________________________________________________________
res5b_branch2b (Conv2D)         (None, 1, 1, 384)    3686784     leaky_re_lu_47[0][0]             
__________________________________________________________________________________________________
bn5b_branch2b (BatchNormalizati (None, 1, 1, 384)    1536        res5b_branch2b[0][0]             
__________________________________________________________________________________________________
leaky_re_lu_48 (LeakyReLU)      (None, 1, 1, 384)    0           bn5b_branch2b[0][0]              
__________________________________________________________________________________________________
res5b_branch2c (Conv2D)         (None, 1, 1, 384)    147840      leaky_re_lu_48[0][0]             
__________________________________________________________________________________________________
bn5b_branch2c (BatchNormalizati (None, 1, 1, 384)    1536        res5b_branch2c[0][0]             
__________________________________________________________________________________________________
add_14 (Add)                    (None, 2, 2, 384)    0           bn5b_branch2c[0][0]              
                                                                 leaky_re_lu_46[0][0]             
__________________________________________________________________________________________________
leaky_re_lu_49 (LeakyReLU)      (None, 2, 2, 384)    0           add_14[0][0]                     
__________________________________________________________________________________________________
res5c_branch2a (Conv2D)         (None, 1, 1, 384)    147840      leaky_re_lu_49[0][0]             
__________________________________________________________________________________________________
bn5c_branch2a (BatchNormalizati (None, 1, 1, 384)    1536        res5c_branch2a[0][0]             
__________________________________________________________________________________________________
leaky_re_lu_50 (LeakyReLU)      (None, 1, 1, 384)    0           bn5c_branch2a[0][0]              
__________________________________________________________________________________________________
res5c_branch2b (Conv2D)         (None, 1, 1, 384)    3686784     leaky_re_lu_50[0][0]             
__________________________________________________________________________________________________
bn5c_branch2b (BatchNormalizati (None, 1, 1, 384)    1536        res5c_branch2b[0][0]             
__________________________________________________________________________________________________
leaky_re_lu_51 (LeakyReLU)      (None, 1, 1, 384)    0           bn5c_branch2b[0][0]              
__________________________________________________________________________________________________
res5c_branch2c (Conv2D)         (None, 1, 1, 384)    147840      leaky_re_lu_51[0][0]             
__________________________________________________________________________________________________
bn5c_branch2c (BatchNormalizati (None, 1, 1, 384)    1536        res5c_branch2c[0][0]             
__________________________________________________________________________________________________
add_15 (Add)                    (None, 2, 2, 384)    0           bn5c_branch2c[0][0]              
                                                                 leaky_re_lu_49[0][0]             
__________________________________________________________________________________________________
leaky_re_lu_52 (LeakyReLU)      (None, 2, 2, 384)    0           add_15[0][0]                     
__________________________________________________________________________________________________
res5d_branch2a (Conv2D)         (None, 1, 1, 384)    147840      leaky_re_lu_52[0][0]             
__________________________________________________________________________________________________
bn5d_branch2a (BatchNormalizati (None, 1, 1, 384)    1536        res5d_branch2a[0][0]             
__________________________________________________________________________________________________
leaky_re_lu_53 (LeakyReLU)      (None, 1, 1, 384)    0           bn5d_branch2a[0][0]              
__________________________________________________________________________________________________
res5d_branch2b (Conv2D)         (None, 1, 1, 384)    3686784     leaky_re_lu_53[0][0]             
__________________________________________________________________________________________________
bn5d_branch2b (BatchNormalizati (None, 1, 1, 384)    1536        res5d_branch2b[0][0]             
__________________________________________________________________________________________________
leaky_re_lu_54 (LeakyReLU)      (None, 1, 1, 384)    0           bn5d_branch2b[0][0]              
__________________________________________________________________________________________________
res5d_branch2c (Conv2D)         (None, 1, 1, 384)    147840      leaky_re_lu_54[0][0]             
__________________________________________________________________________________________________
bn5d_branch2c (BatchNormalizati (None, 1, 1, 384)    1536        res5d_branch2c[0][0]             
__________________________________________________________________________________________________
add_16 (Add)                    (None, 2, 2, 384)    0           bn5d_branch2c[0][0]              
                                                                 leaky_re_lu_52[0][0]             
__________________________________________________________________________________________________
leaky_re_lu_55 (LeakyReLU)      (None, 2, 2, 384)    0           add_16[0][0]                     
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 1, 1, 384)    0           leaky_re_lu_55[0][0]             
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 384)          0           max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 512)          197120      flatten_1[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_56 (LeakyReLU)      (None, 512)          0           dense_3[0][0]                    
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 512)          262656      leaky_re_lu_56[0][0]             
__________________________________________________________________________________________________
leaky_re_lu_57 (LeakyReLU)      (None, 512)          0           dense_4[0][0]                    
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 512)          2048        leaky_re_lu_57[0][0]             
__________________________________________________________________________________________________
dropout_7 (Dropout)             (None, 512)          0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 156)          80028       dropout_7[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_58 (LeakyReLU)      (None, 156)          0           dense_5[0][0]                    
__________________________________________________________________________________________________
fc6 (Dense)                     (None, 6)            942         leaky_re_lu_58[0][0]             
==================================================================================================
Total params: 17,306,266
Trainable params: 17,292,570
Non-trainable params: 13,696
__________________________________________________________________________________________________
None