Downloading data from https://storage.googleapis.com/tensorflow/keras-applications/vgg19/vgg19_weights_tf_dim_ordering_tf_kernels_notop.h5
80142336/80134624 [==============================] - 2s 0us/step
Model: "functional_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_4 (InputLayer)         [(None, 72, 72, 3)]       0         
_________________________________________________________________
block1_conv1 (Conv2D)        (None, 72, 72, 64)        1792      
_________________________________________________________________
block1_conv2 (Conv2D)        (None, 72, 72, 64)        36928     
_________________________________________________________________
block1_pool (MaxPooling2D)   (None, 36, 36, 64)        0         
_________________________________________________________________
block2_conv1 (Conv2D)        (None, 36, 36, 128)       73856     
_________________________________________________________________
block2_conv2 (Conv2D)        (None, 36, 36, 128)       147584    
_________________________________________________________________
block2_pool (MaxPooling2D)   (None, 18, 18, 128)       0         
_________________________________________________________________
block3_conv1 (Conv2D)        (None, 18, 18, 256)       295168    
_________________________________________________________________
block3_conv2 (Conv2D)        (None, 18, 18, 256)       590080    
_________________________________________________________________
block3_conv3 (Conv2D)        (None, 18, 18, 256)       590080    
_________________________________________________________________
block3_conv4 (Conv2D)        (None, 18, 18, 256)       590080    
_________________________________________________________________
block3_pool (MaxPooling2D)   (None, 9, 9, 256)         0         
_________________________________________________________________
block4_conv1 (Conv2D)        (None, 9, 9, 512)         1180160   
_________________________________________________________________
block4_conv2 (Conv2D)        (None, 9, 9, 512)         2359808   
_________________________________________________________________
block4_conv3 (Conv2D)        (None, 9, 9, 512)         2359808   
_________________________________________________________________
block4_conv4 (Conv2D)        (None, 9, 9, 512)         2359808   
_________________________________________________________________
block4_pool (MaxPooling2D)   (None, 4, 4, 512)         0         
_________________________________________________________________
block5_conv1 (Conv2D)        (None, 4, 4, 512)         2359808   
_________________________________________________________________
block5_conv2 (Conv2D)        (None, 4, 4, 512)         2359808   
_________________________________________________________________
block5_conv3 (Conv2D)        (None, 4, 4, 512)         2359808   
_________________________________________________________________
block5_conv4 (Conv2D)        (None, 4, 4, 512)         2359808   
_________________________________________________________________
block5_pool (MaxPooling2D)   (None, 2, 2, 512)         0         
_________________________________________________________________
flatten (Flatten)            (None, 2048)              0         
_________________________________________________________________
dense_8 (Dense)              (None, 512)               1049088   
_________________________________________________________________
dense_9 (Dense)              (None, 512)               262656    
_________________________________________________________________
dropout_3 (Dropout)          (None, 512)               0         
_________________________________________________________________
dense_10 (Dense)             (None, 156)               80028     
_________________________________________________________________
dense_11 (Dense)             (None, 7)                 1099      
=================================================================
Total params: 21,417,255
Trainable params: 1,392,871
Non-trainable params: 20,024,384
_________________________________________________________________
None