Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 48, 48, 3)]       0         
_________________________________________________________________
separable_conv2d (SeparableC (None, 44, 44, 48)        267       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      (None, 44, 44, 48)        0         
_________________________________________________________________
batch_normalization (BatchNo (None, 44, 44, 48)        192       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 22, 22, 48)        0         
_________________________________________________________________
dropout (Dropout)            (None, 22, 22, 48)        0         
_________________________________________________________________
conv2d (Conv2D)              (None, 22, 22, 192)       230592    
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 22, 22, 192)       0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 22, 22, 192)       921792    
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 22, 22, 192)       0         
_________________________________________________________________
separable_conv2d_1 (Separabl (None, 18, 18, 192)       41856     
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 18, 18, 192)       0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 18, 18, 192)       768       
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 9, 9, 192)         0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 9, 9, 192)         0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 9, 9, 384)         1843584   
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (None, 9, 9, 384)         0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 9, 9, 384)         3686784   
_________________________________________________________________
leaky_re_lu_5 (LeakyReLU)    (None, 9, 9, 384)         0         
_________________________________________________________________
batch_normalization_2 (Batch (None, 9, 9, 384)         1536      
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 9, 9, 384)         3686784   
_________________________________________________________________
leaky_re_lu_6 (LeakyReLU)    (None, 9, 9, 384)         0         
_________________________________________________________________
separable_conv2d_2 (Separabl (None, 5, 5, 384)         157440    
_________________________________________________________________
leaky_re_lu_7 (LeakyReLU)    (None, 5, 5, 384)         0         
_________________________________________________________________
batch_normalization_3 (Batch (None, 5, 5, 384)         1536      
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 2, 2, 384)         0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 2, 2, 384)         0         
_________________________________________________________________
flatten (Flatten)            (None, 1536)              0         
_________________________________________________________________
dense (Dense)                (None, 512)               786944    
_________________________________________________________________
leaky_re_lu_8 (LeakyReLU)    (None, 512)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 512)               262656    
_________________________________________________________________
leaky_re_lu_9 (LeakyReLU)    (None, 512)               0         
_________________________________________________________________
batch_normalization_4 (Batch (None, 512)               2048      
_________________________________________________________________
dropout_3 (Dropout)          (None, 512)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 156)               80028     
_________________________________________________________________
leaky_re_lu_10 (LeakyReLU)   (None, 156)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 6)                 942       
=================================================================
Total params: 11,705,749
Trainable params: 11,702,709
Non-trainable params: 3,040
_________________________________________________________________
None