Model: "functional_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 48, 48, 3)]       0         
_________________________________________________________________
conv2d (Conv2D)              (None, 48, 48, 48)        1344      
_________________________________________________________________
batch_normalization (BatchNo (None, 48, 48, 48)        192       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 24, 24, 48)        0         
_________________________________________________________________
dropout (Dropout)            (None, 24, 24, 48)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 24, 24, 96)        41568     
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 24, 24, 96)        83040     
_________________________________________________________________
batch_normalization_1 (Batch (None, 24, 24, 96)        384       
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 12, 12, 96)        0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 12, 12, 96)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 12, 12, 384)       332160    
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 12, 12, 384)       1327488   
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 12, 12, 384)       1327488   
_________________________________________________________________
batch_normalization_2 (Batch (None, 12, 12, 384)       1536      
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 6, 6, 384)         0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 6, 6, 384)         0         
_________________________________________________________________
flatten (Flatten)            (None, 13824)             0         
_________________________________________________________________
dense (Dense)                (None, 512)               7078400   
_________________________________________________________________
dense_1 (Dense)              (None, 512)               262656    
_________________________________________________________________
batch_normalization_3 (Batch (None, 512)               2048      
_________________________________________________________________
dropout_3 (Dropout)          (None, 512)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 512)               262656    
_________________________________________________________________
dense_3 (Dense)              (None, 512)               262656    
_________________________________________________________________
batch_normalization_4 (Batch (None, 512)               2048      
_________________________________________________________________
dropout_4 (Dropout)          (None, 512)               0         
_________________________________________________________________
dense_4 (Dense)              (None, 156)               80028     
_________________________________________________________________
dense_5 (Dense)              (None, 6)                 942       
=================================================================
Total params: 11,066,634
Trainable params: 11,063,530
Non-trainable params: 3,104
_________________________________________________________________
None